// constants.js = 상수창고

// 도시 보정시 상수
export const 도시_보정시 = {
  "서울특별시": 126.9780, "부산광역시": 129.1, "대구광역시": 128.6,
  "인천광역시": 126.7052, "광주광역시": 126.8530, "대전광역시": 127.3845,
  "울산광역시": 129.3114, "세종특별자치시": 127.2890,
  "수원시": 127.0014, "고양시": 126.83, "용인시": 127.1731,
  "성남시": 127.137, "부천시": 126.766, "안산시": 126.851,
  "안양시": 126.9566, "남양주시": 127.2623, "화성시": 126.831,
  "평택시": 127.1116, "시흥시": 126.79, "김포시": 126.715,
  "파주시": 126.783, "의정부시": 127.0469, "광명시": 126.8826,
  "광주시": 126.666, "군포시": 126.935, "이천시": 127.443,
  "양주시": 127.03, "오산시": 127.079, "구리시": 127.13,
  "안성시": 127.279, "포천시": 127.2, "의왕시": 126.931,
  "하남시": 127.214, "여주시": 127.652, "동두천시": 127.05,
  "과천시": 126.984, "가평군": 127.51, "양평군": 127.5, "연천군": 127.1,
  "춘천시": 127.729, "원주시": 127.93, "강릉시": 128.896, "동해시": 129.113,
  "태백시": 128.986, "속초시": 128.591, "삼척시": 129.168, "홍천군": 127.88,
  "횡성군": 128.425, "영월군": 128.613, "평창군": 128.424, "정선군": 128.7,
  "철원군": 127.415, "화천군": 127.753, "양구군": 128.47, "인제군": 128.116,
  "고성군": 128.467, "양양군": 128.692,
  "청주시": 127.4914, "충주시": 127.9323, "제천시": 128.1926, "보은군": 127.728,
  "옥천군": 127.609, "영동군": 128.382, "진천군": 127.439, "괴산군": 127.731,
  "음성군": 127.674, "단양군": 128.377, "증평군": 127.48,
  "천안시": 127.146, "공주시": 127.098, "보령시": 126.611, "아산시": 127.001,
  "서산시": 126.449, "논산시": 127.074, "계룡시": 127.264, "당진시": 126.621,
  "금산군": 127.386, "부여군": 126.802, "서천군": 126.781, "청양군": 126.856,
  "홍성군": 126.726, "예산군": 126.678, "태안군": 126.325,
  "전주시": 127.108, "군산시": 126.711, "익산시": 126.957, "정읍시": 126.846,
  "남원시": 127.392, "김제시": 126.871, "완주군": 127.062, "진안군": 127.229,
  "무주군": 127.69, "장수군": 127.891, "임실군": 127.409, "순창군": 127.13,
  "고창군": 126.785, "부안군": 126.73,
  "목포시": 126.411, "여수시": 127.643, "순천시": 127.496, "나주시": 126.717,
  "광양시": 127.695, "담양군": 126.984, "곡성군": 127.262, "구례군": 127.392,
  "고흥군": 127.384, "보성군": 127.122, "화순군": 127.04, "장흥군": 126.725,
  "강진군": 126.645, "해남군": 126.531, "영암군": 126.682, "무안군": 126.731,
  "함평군": 126.625, "영광군": 126.509, "장성군": 126.751, "완도군": 126.653,
  "진도군": 126.359, "신안군": 126.361,
  "포항시": 129.366, "경주시": 129.224, "김천시": 128.198, "안동시": 128.723,
  "구미시": 128.344, "영주시": 128.637, "영천시": 128.733, "상주시": 128.159,
  "문경시": 128.185, "경산시": 128.734, "군위군": 128.454, "의성군": 128.181,
  "청송군": 128.218, "영양군": 128.276, "영덕군": 128.703, "청도군": 128.626,
  "고령군": 128.347, "성주군": 128.177, "칠곡군": 128.54, "예천군": 128.245,
  "봉화군": 128.363, "울진군": 129.341, "울릉군": 130.904,
  "창원시": 128.681, "김해시": 128.881, "진주시": 128.092, "양산시": 129.045,
  "거제시": 128.678, "사천시": 128.189, "밀양시": 128.747, "통영시": 128.425,
  "거창군": 128.184, "고성군": 128.373, "남해군": 127.902, "산청군": 127.779,
  "창녕군": 128.415, "하동군": 127.997, "함안군": 128.389, "함양군": 127.81,
  "합천군": 128.175,
  "의령군": 128.29,
  "제주시": 126.5312, "서귀포시": 126.715
};

// 천간, 지지, 간지 순서대로 담은 배열 상수들
export const 천간_매핑 = ["갑", "을", "병", "정", "무", "기", "경", "신", "임", "계"];
export const 지지_매핑 = ["자", "축", "인", "묘", "진", "사", "오", "미", "신", "유", "술", "해"];
export const 간지_월_순서_매핑 = ["인", "묘", "진", "사", "오", "미", "신", "유", "술", "해", "자", "축"];

// 월/시두법 맵핑 상수
export const 월_시_두법_매핑 = {
  "갑": ["병인", "정묘", "무진", "기사", "경오", "신미", "임신", "계유", "갑술", "을해", "병자", "정축"],
  "을": ["무인", "기묘", "경진", "신사", "임오", "계미", "갑신", "을유", "병술", "정해", "무자", "기축"],
  "병": ["경인", "신묘", "임진", "계사", "갑오", "을미", "병신", "정유", "무술", "기해", "경자", "신축"],
  "정": ["임인", "계묘", "갑진", "을사", "병오", "정미", "무신", "기유", "경술", "신해", "임자", "계축"],
  "무": ["갑인", "을묘", "병진", "정사", "무오", "기미", "경신", "신유", "임술", "계해", "갑자", "을축"],
  "기": ["병인", "정묘", "무진", "기사", "경오", "신미", "임신", "계유", "갑술", "을해", "병자", "정축"],
  "경": ["무인", "기묘", "경진", "신사", "임오", "계미", "갑신", "을유", "병술", "정해", "무자", "기축"],
  "신": ["경인", "신묘", "임진", "계사", "갑오", "을미", "병신", "정유", "무술", "기해", "경자", "신축"],
  "임": ["임인", "계묘", "갑진", "을사", "병오", "정미", "무신", "기유", "경술", "신해", "임자", "계축"],
  "계": ["갑인", "을묘", "병진", "정사", "무오", "기미", "경신", "신유", "임술", "계해", "갑자", "을축"]
};

// 60갑자 사이클 배열 상수
export const 육십갑자_순서_매핑 = [
  "갑자", "을축", "병인", "정묘", "무진", "기사", "경오", "신미", "임신", "계유",
  "갑술", "을해", "병자", "정축", "무인", "기묘", "경진", "신사", "임오", "계미",
  "갑신", "을유", "병술", "정해", "무자", "기축", "경인", "신묘", "임진", "계사",
  "갑오", "을미", "병신", "정유", "무술", "기해", "경자", "신축", "임인", "계묘",
  "갑진", "을사", "병오", "정미", "무신", "기유", "경술", "신해", "임자", "계축",
  "갑인", "을묘", "병진", "정사", "무오", "기미", "경신", "신유", "임술", "계해"
];

// 천간 맵핑 함수 (한자, 천간 풀네임, 음양 구분)
export const 천간_정보_매핑 = {
  "갑": { hanja: "甲", hanguel: "갑목", eumYang: "양" },
  "을": { hanja: "乙", hanguel: "을목", eumYang: "음" },
  "병": { hanja: "丙", hanguel: "병화", eumYang: "양" },
  "정": { hanja: "丁", hanguel: "정화", eumYang: "음" },
  "무": { hanja: "戊", hanguel: "무토", eumYang: "양" },
  "기": { hanja: "己", hanguel: "기토", eumYang: "음" },
  "경": { hanja: "庚", hanguel: "경금", eumYang: "양" },
  "신": { hanja: "辛", hanguel: "신금", eumYang: "음" },
  "임": { hanja: "壬", hanguel: "임수", eumYang: "양" },
  "계": { hanja: "癸", hanguel: "계수", eumYang: "음" }
};


// 지지 맵핑 함수 (한자, 지지 풀네임, 음양 구분)
export const 지지_정보_매핑 = {
  "자": {
    hanja: "子",
    hanguel: "자수",
    eumYang: "양(음)",
    time: { start: 1380, end: 60 }
  },
  "축": {
    hanja: "丑",
    hanguel: "축토",
    eumYang: "음",
    time: { start: 60, end: 180 }
  },
  "인": {
    hanja: "寅",
    hanguel: "인목",
    eumYang: "양",
    time: { start: 180, end: 300 }
  },
  "묘": {
    hanja: "卯",
    hanguel: "묘목",
    eumYang: "음",
    time: { start: 300, end: 420 }
  },
  "진": {
    hanja: "辰",
    hanguel: "진토",
    eumYang: "양",
    time: { start: 420, end: 540 }
  },
  "사": {
    hanja: "巳",
    hanguel: "사화",
    eumYang: "음(양)",
    time: { start: 540, end: 660 }
  },
  "오": {
    hanja: "午",
    hanguel: "오화",
    eumYang: "양(음)",
    time: { start: 660, end: 780 }
  },
  "미": {
    hanja: "未",
    hanguel: "미토",
    eumYang: "음",
    time: { start: 780, end: 900 }
  },
  "신": {
    hanja: "申",
    hanguel: "신금",
    eumYang: "양",
    time: { start: 900, end: 1020 }
  },
  "유": {
    hanja: "酉",
    hanguel: "유금",
    eumYang: "음",
    time: { start: 1020, end: 1140 }
  },
  "술": {
    hanja: "戌",
    hanguel: "술토",
    eumYang: "양",
    time: { start: 1140, end: 1260 }
  },
  "해": {
    hanja: "亥",
    hanguel: "해수",
    eumYang: "음(양)",
    time: { start: 1260, end: 1380 }
  }
};

// 십신 매핑
export const 천간_십신_매핑 = {
  "갑": {
    "갑": "비견",
    "을": "겁재",
    "병": "식신",
    "정": "상관",
    "무": "편재",
    "기": "정재",
    "경": "편관",
    "신": "정관",
    "임": "편인",
    "계": "정인"
  },
  "을": {
    "갑": "겁재",
    "을": "비견",
    "병": "상관",
    "정": "식신",
    "무": "정재",
    "기": "편재",
    "경": "정관",
    "신": "편관",
    "임": "정인",
    "계": "편인"
  },
  "병": {
    "갑": "편인",
    "을": "정인",
    "병": "비견",
    "정": "겁재",
    "무": "식신",
    "기": "상관",
    "경": "편재",
    "신": "정재",
    "임": "편관",
    "계": "정관"
  },
  "정": {
    "갑": "정인",
    "을": "편인",
    "병": "겁재",
    "정": "비견",
    "무": "상관",
    "기": "식상",
    "경": "정재",
    "신": "편재",
    "임": "정관",
    "계": "편관"
  },
  "무": {
    "갑": "편관",
    "을": "정관",
    "병": "편인",
    "정": "정인",
    "무": "비견",
    "기": "겁재",
    "경": "식신",
    "신": "상관",
    "임": "편재",
    "계": "정재"
  },
  "기": {
    "갑": "정관",
    "을": "편관",
    "병": "정인",
    "정": "편인",
    "무": "겁재",
    "기": "비견",
    "경": "상관",
    "신": "식신",
    "임": "정재",
    "계": "편재"
  },
  "경": {
    "갑": "편재",
    "을": "정재",
    "병": "편관",
    "정": "정관",
    "무": "편인",
    "기": "정인",
    "경": "비견",
    "신": "겁재",
    "임": "식신",
    "계": "상관"
  },
  "신": {
    "갑": "정재",
    "을": "편재",
    "병": "정관",
    "정": "편관",
    "무": "정인",
    "기": "편인",
    "경": "겁재",
    "신": "비견",
    "임": "상관",
    "계": "식신"
  },
  "임": {
    "갑": "식신",
    "을": "상관",
    "병": "편재",
    "정": "정재",
    "무": "편관",
    "기": "정관",
    "경": "편인",
    "신": "정인",
    "임": "비견",
    "계": "겁재"
  },
  "계": {
    "갑": "식신",
    "을": "상관",
    "병": "편재",
    "정": "정재",
    "무": "편관",
    "기": "정관",
    "경": "편인",
    "신": "정인",
    "임": "비견",
    "계": "겁재"
  }
};


export const 지지_십신_매핑 = {
  "갑": {
    "자": "정인",
    "축": "정재",
    "인": "비견",
    "묘": "겁재",
    "진": "편재",
    "사": "상관",
    "오": "식신",
    "미": "정재",
    "신": "편관",
    "유": "정관",
    "술": "편재",
    "해": "편인"
  },
  "을": {
    "자": "편인",
    "축": "편재",
    "인": "겁재",
    "묘": "비견",
    "진": "정재",
    "사": "식신",
    "오": "상관",
    "미": "편재",
    "신": "정관",
    "유": "편관",
    "술": "정재",
    "해": "정인"
  },
  "병": {
    "자": "정관",
    "축": "상관",
    "인": "편인",
    "묘": "정인",
    "진": "식신",
    "사": "비견",
    "오": "겁재",
    "미": "상관",
    "신": "편재",
    "유": "정재",
    "술": "식신",
    "해": "편인"
  },
  "정": {
    "자": "편관",
    "축": "식신",
    "인": "정인",
    "묘": "편인",
    "진": "상관",
    "사": "겁재",
    "오": "비견",
    "미": "식신",
    "신": "정재",
    "유": "편재",
    "술": "상관",
    "해": "정인"
  },
  "무": {
    "자": "정재",
    "축": "겁재",
    "인": "편관",
    "묘": "정관",
    "진": "비견",
    "사": "편인",
    "오": "정인",
    "미": "겁재",
    "신": "식신",
    "유": "상관",
    "술": "비견",
    "해": "편재"
  },
  "기": {
    "자": "편재",
    "축": "비견",
    "인": "정관",
    "묘": "편관",
    "진": "겁재",
    "사": "정인",
    "오": "편인",
    "미": "비견",
    "신": "상관",
    "유": "식신",
    "술": "겁재",
    "해": "정재"
  },
  "경": {
    "자": "상관",
    "축": "정인",
    "인": "편재",
    "묘": "정재",
    "진": "편인",
    "사": "편관",
    "오": "정관",
    "미": "정인",
    "신": "비견",
    "유": "겁재",
    "술": "편인",
    "해": "식신"
  },
  "신": {
    "자": "식신",
    "축": "편인",
    "인": "정재",
    "묘": "편재",
    "진": "정인",
    "사": "정관",
    "오": "편관",
    "미": "편인",
    "신": "겁재",
    "유": "비견",
    "술": "정인",
    "해": "상관"
  },
  "임": {
    "자": "겁재",
    "축": "정관",
    "인": "식상",
    "묘": "상관",
    "진": "편관",
    "사": "편재",
    "오": "정재",
    "미": "정관",
    "신": "편인",
    "유": "정인",
    "술": "편인",
    "해": "비견"
  },
  "계": {
    "자": "비견",
    "축": "편관",
    "인": "상관",
    "묘": "식신",
    "진": "정관",
    "사": "정재",
    "오": "편재",
    "미": "편관",
    "신": "정인",
    "유": "편인",
    "술": "정인",
    "해": "겁재"
  }
};


export const 색상_매핑 = {
  "甲": { textColor: "green", bgColor: "b_green" },
  "乙": { textColor: "green", bgColor: "b_green" },
  "丙": { textColor: "red", bgColor: "b_red" },
  "丁": { textColor: "red", bgColor: "b_red" },
  "戊": { textColor: "yellow", bgColor: "b_yellow" },
  "己": { textColor: "yellow", bgColor: "b_yellow" },
  "庚": { textColor: "white", bgColor: "b_white" },
  "辛": { textColor: "white", bgColor: "b_white" },
  "壬": { textColor: "black", bgColor: "b_black" },
  "癸": { textColor: "black", bgColor: "b_black" },
  "子": { textColor: "black", bgColor: "b_black" },
  "丑": { textColor: "yellow", bgColor: "b_yellow" },
  "寅": { textColor: "green", bgColor: "b_green" },
  "卯": { textColor: "green", bgColor: "b_green" },
  "辰": { textColor: "yellow", bgColor: "b_yellow" },
  "巳": { textColor: "red", bgColor: "b_red" },
  "午": { textColor: "red", bgColor: "b_red" },
  "未": { textColor: "yellow", bgColor: "b_yellow" },
  "申": { textColor: "white", bgColor: "b_white" },
  "酉": { textColor: "white", bgColor: "b_white" },
  "戌": { textColor: "yellow", bgColor: "b_yellow" },
  "亥": { textColor: "black", bgColor: "b_black" }
};

export const 지장간_매핑 = {
  "자": ["(-)", "(-)", "계"],
  "축": ["계", "신", "기"],
  "인": ["(-)", "병", "갑"],
  "묘": ["(-)", "(-)", "을"],
  "진": ["을", "계", "무"],
  "사": ["(-)", "경", "병"],
  "오": ["(-)", "(-)", "정"],
  "미": ["정", "을", "기"],
  "신": ["(-)", "임", "경"],
  "유": ["(-)", "(-)", "신"],
  "술": ["신", "정", "무"],
  "해": ["(-)", "갑", "임"]
};

export function 십이운성_매핑(baseDayStem, branch) {
  const mapping = {
    "갑": { "자": "목욕", "축": "관대", "인": "건록", "묘": "제왕", "진": "쇠", "사": "병", "오": "사", "미": "묘", "신": "절", "유": "태", "술": "양", "해": "장생" },
    "을": { "자": "병", "축": "쇠", "인": "제왕", "묘": "건록", "진": "관대", "사": "목욕", "오": "장생", "미": "양", "신": "태", "유": "절", "술": "묘", "해": "사" },
    "병": { "자": "태", "축": "양", "인": "장생", "묘": "목욕", "진": "관대", "사": "건록", "오": "제왕", "미": "쇠", "신": "병", "유": "사", "술": "묘", "해": "절" },
    "정": { "자": "절", "축": "묘", "인": "사", "묘": "병", "진": "쇠", "사": "제왕", "오": "건록", "미": "관대", "신": "목욕", "유": "장생", "술": "양", "해": "태" },
    "무": { "자": "태", "축": "양", "인": "장생", "묘": "목욕", "진": "관대", "사": "건록", "오": "제왕", "미": "쇠", "신": "병", "유": "사", "술": "묘", "해": "절" },
    "기": { "자": "절", "축": "묘", "인": "사", "묘": "병", "진": "쇠", "사": "제왕", "오": "건록", "미": "관대", "신": "목욕", "유": "장생", "술": "양", "해": "태" },
    "경": { "자": "사", "축": "묘", "인": "절", "묘": "태", "진": "양", "사": "장생", "오": "목욕", "미": "관대", "신": "건록", "유": "제왕", "술": "쇠", "해": "병" },
    "신": { "자": "장생", "축": "양", "인": "태", "묘": "절", "진": "묘", "사": "사", "오": "병", "미": "쇠", "신": "제왕", "유": "건록", "술": "관대", "해": "목욕" },
    "임": { "자": "제왕", "축": "쇠", "인": "병", "묘": "사", "진": "묘", "사": "절", "오": "태", "미": "양", "신": "장생", "유": "목욕", "술": "관대", "해": "건록" },
    "계": { "자": "건록", "축": "관대", "인": "목욕", "묘": "장생", "진": "양", "사": "태", "오": "절", "미": "묘", "신": "사", "유": "병", "술": "쇠", "해": "제왕" }
  };
  return mapping[baseDayStem] ? mapping[baseDayStem][branch] || "" : "";
}

export function 십이신살_매핑(yearBranch, branch) {
  const mapping = {
    "자": { "자": "장성", "축": "반안", "인": "역마", "묘": "육해", "진": "화개", "사": "겁살", "오": "재살", "미": "천살", "신": "지살", "유": "년살", "술": "월살", "해": "망신" },
    "축": { "자": "망신", "축": "장성", "인": "반안", "묘": "역마", "진": "육해", "사": "화개", "오": "겁살", "미": "재살", "신": "천살", "유": "지살", "술": "년살", "해": "월살" },
    "인": { "자": "월살", "축": "망신", "인": "장성", "묘": "반안", "진": "역마", "사": "육해", "오": "화개", "미": "겁살", "신": "재살", "유": "천살", "술": "지살", "해": "년살" },
    "묘": { "자": "년살", "축": "월살", "인": "망신", "묘": "장성", "진": "반안", "사": "역마", "오": "육해", "미": "화개", "신": "겁살", "유": "재살", "술": "천살", "해": "지살" },
    "진": { "자": "지살", "축": "년살", "인": "월살", "묘": "망신", "진": "장성", "사": "반안", "오": "역마", "미": "육해", "신": "화개", "유": "겁살", "술": "재살", "해": "천살" },
    "사": { "자": "천살", "축": "지살", "인": "년살", "묘": "월살", "진": "망신", "사": "장성", "오": "반안", "미": "역마", "신": "육해", "유": "화개", "술": "겁살", "해": "재살" },
    "오": { "자": "재살", "축": "천살", "인": "지살", "묘": "년살", "진": "월살", "사": "망신", "오": "장성", "미": "반안", "신": "역마", "유": "육해", "술": "화개", "해": "겁살" },
    "미": { "자": "겁살", "축": "재살", "인": "천살", "묘": "지살", "진": "년살", "사": "월살", "오": "망신", "미": "장성", "신": "반안", "유": "역마", "술": "육해", "해": "화개" },
    "신": { "자": "화개", "축": "겁살", "인": "재살", "묘": "천살", "진": "지살", "사": "년살", "오": "월살", "미": "망신", "신": "장성", "유": "반안", "술": "역마", "해": "육해" },
    "유": { "자": "육해", "축": "화개", "인": "겁살", "묘": "재살", "진": "천살", "사": "지살", "오": "년살", "미": "월살", "신": "망신", "유": "장성", "술": "반안", "해": "역마" },
    "술": { "자": "역마", "축": "육해", "인": "화개", "묘": "겁살", "진": "재살", "사": "천살", "오": "지살", "미": "년살", "신": "월살", "유": "망신", "술": "장성", "해": "반안" },
    "해": { "자": "반안", "축": "역마", "인": "육해", "묘": "화개", "진": "겁살", "사": "재살", "오": "천살", "미": "지살", "신": "년살", "유": "월살", "술": "망신", "해": "장성" }
  };
  return mapping[yearBranch] ? mapping[yearBranch][branch] || "" : "";
}